# Start Jupiter Notebook

In [3]:
import pandas as pd

In [4]:
!pip install pandas

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in d:\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in d:\anaconda\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in d:\anaconda\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

## loading python lybraries

In [5]:
import pandas as pd

In [6]:
#import python libraries
import numpy as np
import matplotlib as mpl
import seaborn as sns

## reading data using pandas

In [7]:
#read csv files
df=pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [8]:
#pd.read_excel('myfile.xlsx',sheet_name='sheet1')
#pd.read_stata('myfile.dta')
#pd.read_sas('myfile.sas7bdta')
#pd.read_hdf('myfile.h5','df')

## Exploring data frames

In [9]:
#list first 5 records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [10]:
#read the first 10,20,50,records
df.head(10);
df.head(20);
df.head(50);

In [11]:
#ckeck particular column type
df['rank'].dtype

dtype('O')

In [12]:
df['discipline'].dtype

dtype('O')

In [13]:
df['phd'].dtype

dtype('int64')

In [14]:
df['sex'].dtype

dtype('O')

In [15]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [16]:
#list the column name
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [17]:
# particular column
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

## data frame attributes

In [18]:
#lise the row lables and column names
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [19]:
#number of dimensions
df.ndim

2

In [20]:
#number of elements (no. of records)
df.size

468

In [21]:
#return a tuple representing the dimensionly
df.shape

(78, 6)

In [22]:
#numpy represetation of data
df.values;

In [23]:
#how many recards in this data frame has
df.count()

rank          78
discipline    78
phd           78
service       78
sex           78
salary        78
dtype: int64

## Data frame mathods

In [24]:
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [25]:
#for summery
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [26]:
#max of all data
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [27]:
#max of particular column
df.phd.max()

56

In [28]:
#min for all data
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [29]:
#min for particular column
df.sex.min()

'Female'

In [30]:
#mean of all data
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [31]:
#mean of particular column
df.service.mean()

15.051282051282051

In [32]:
#median of data
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [33]:
#median for particular column
df.salary.median()

104671.0

In [34]:
#stansard deviation of data
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [35]:
#std of particular column
df.phd.std()

12.498424809175866

In [36]:
#return a random sample of the data frame
df.sample()

        rank discipline  phd  service     sex  salary
60  AsstProf          B    3        3  Female   92000

In [37]:
#drop all the records with missing values
df.dropna()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [38]:
#value count of particular column
df.discipline.value_counts()

B    42
A    36
Name: discipline, dtype: int64

In [39]:
#mean value of first 50 records
df_50=df.head(50)
df_50.mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [40]:
# or mean value of first 50 recards
df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [41]:
#access particular column
df['rank']

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [42]:
#access particular column with heading(for 2dim o/p)
df[['rank']]

         rank
0        Prof
1        Prof
2        Prof
3        Prof
4        Prof
..        ...
73       Prof
74  AssocProf
75       Prof
76       Prof
77       Prof

[78 rows x 1 columns]

In [43]:
#calculate basic statistic for phd column
df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [44]:
#find how many values in the phd column
df.phd.count()

78

In [45]:
#calculate average of phd
df.phd.mean()

19.705128205128204

### data frame groupby method

In [46]:
#group data using rank
df.groupby(['rank'])

In [47]:
#mean value of each numeric column per each group of rank
df.groupby(['rank']).mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [48]:
#calculate mean salary of each prof. rank
df.groupby(['rank'],sort=False)[['salary']].mean()

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

In [49]:
#calculate mean salary and phd of each prof. rank
df.groupby(['rank'])[['salary','phd']].mean()

                  salary        phd
rank
AssocProf   91786.230769  15.076923
AsstProf    81362.789474   5.052632
Prof       123624.804348  27.065217

## data frame filtering

In [50]:
#select those who have >120000 salaries
df[df['salary']>120000 ]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

In [51]:
#select only females
df[df['sex']=='Female']

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

## data frame method iloc

In [52]:
#first row of data frame
df.iloc[[0]]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960

In [53]:
#19th row of data frame
df.iloc[[19]]

    rank discipline  phd  service   sex  salary
19  Prof          A   29       27  Male  150500

In [54]:
#last row of dataframe
df.iloc[[-1]]

    rank discipline  phd  service     sex  salary
77  Prof          A   23       15  Female  109646

In [55]:
#first column of data frame
df.iloc[:,0]

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [56]:
df.iloc[:,-1]

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [57]:
#first 7 rows
df.iloc[:7]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [58]:
#first 2 column 
df.iloc[:,:2]

         rank discipline
0        Prof          B
1        Prof          A
2        Prof          A
3        Prof          A
4        Prof          B
..        ...        ...
73       Prof          B
74  AssocProf          B
75       Prof          B
76       Prof          A
77       Prof          A

[78 rows x 2 columns]

In [59]:
#first and second row and first 2 column
df.iloc[1:3,:2]

   rank discipline
1  Prof          A
2  Prof          A

In [60]:
#1st and 5th row and 3rd and 4th column
df.iloc[[1,5],[3,4]]

   service   sex
1        6  Male
5       20  Male

## Aggregation functions in pandas

In [61]:
df[['phd','salary']].agg(['min','mean','max'])

            phd         salary
min    1.000000   57800.000000
mean  19.705128  108023.782051
max   56.000000  186960.000000

In [62]:
df[['salary']].agg(['std','var'])

           salary
std  2.829366e+04
var  8.005313e+08

In [84]:
df[['service','salary']].agg(['median','sem']) #sem=standard error of mean

          service         salary
median  14.500000  104671.000000
sem      1.374558    3203.626259

In [85]:
df[['phd','salary']].agg(['skew','kurt'])

           phd    salary
skew  0.634366  0.452103
kurt  0.042504 -0.401713

In [87]:
#df[['rank','sex']].agg(['skew','kurt']) #column should be numeric for skew & kurt

## data frame sorting

In [63]:
df_sorted=df.sort_values(by='service')
df_sorted.tail()

    rank discipline  phd  service     sex  salary
40  Prof          A   39       36  Female  137000
27  Prof          A   45       43    Male  155865
36  Prof          B   45       45    Male  146856
0   Prof          B   56       49    Male  186960
9   Prof          A   51       51    Male   57800

In [64]:
df_sorted=df.sort_values(by='salary')

In [69]:
df_sorted=df.sort_values(by=['service','salary'],ascending=[True,True])
df_sorted.head(5)

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
43  AsstProf          B    5        0  Female   77000
23  AsstProf          A    2        0    Male   85000
12  AsstProf          B    1        0    Male   88000
17  AsstProf          B    4        0    Male   92000

In [70]:
df_sorted=df.sort_values(by=['service','salary'],ascending=[True,False])
df_sorted.head(5)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000

In [72]:
df_sorted=df.sort_values(by=['phd','service'],ascending=['True','True'])
df_sorted.head(5)

        rank discipline  phd  service     sex  salary
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
60  AsstProf          B    3        3  Female   92000